/********************************************************
  @Author:   丁雪峰
  @File:     display.h
  @LastTime: 2013-08-07 18:30:11
  @Version:  1.0.1
  Description:
     输出模块.
     主要是调用了data中的data_api类,对于后台信息进行提取
     并设计了输出的界面样式.与交互操作
********************************************************/
#ifndef DISPLAY
#define DISPLAY

/****************************************************************
 * Function:curses_display_start
 * Description:
 * 这是文本界面输出的入口函数
 * 主要完成两个功能
 *    启动后台数据采集程序
 *    进程WaitForUser
****************************************************************/
int CursesDisplayStart();

/****************************************************************
 * Function:WaitForUser
 * Description:
 *    等待用户输出,并执行相应动作
 *          按j,列表下移
 *          按k,列表上移
 *          按q,退出
 *
 *          在不同输入,会控制线程的开启与结束,不同的线程对应于不同的界面设计
****************************************************************/
static int WaitForUser();
//
//***************************************************************
// Description:
//     这个函数完成了进程的全部信息的输出窗口的设计与输出
//     并且是一个线程函数.
//**************************************************************/
static void * Display(void *);

//discription:刷新list输出的显示
static int DisplayList();
/****************************************************************
 * Function:display
 * Description:
 *     完成DisplayList用到的窗口的大小的初始化分配
****************************************************************/
static void DisplayListWin();


static int FocusProcCpu();

//description:用于Display空运行没有要输出时使用
static void JuseRun();
#endif
